[
  { "id": 1, "mode": "I", "text": "Depois de um dia cheio (escola, estudos ou projetos), ficar mais na minha, em silêncio ou fazendo algo sozinho me ajuda a me sentir melhor." },
  { "id": 2, "mode": "I", "text": "Depois de um dia cheio, conversar e trocar ideia com outras pessoas me ajuda a recarregar as energias." },
  { "id": 3, "mode": "F", "text": "Lidar com muitas pessoas ao longo do dia me cansa." },
  { "id": 4, "mode": "F", "text": "Passar muito tempo sozinho, sem interação, me cansa." },
  { "id": 5, "mode": "I", "text": "Ambientes calmos, com poucas interrupções, me ajudam a me concentrar melhor." },
  { "id": 6, "mode": "I", "text": "Ambientes mais movimentados, com pessoas por perto, me deixam mais motivado." },
  { "id": 7, "mode": "I", "text": "Ter tempo para pensar sozinho me ajuda a organizar melhor as ideias." },
  { "id": 8, "mode": "I", "text": "Ficar em grupo por longos períodos me dá mais energia do que me cansa." },
  { "id": 9, "mode": "I", "text": "Uma rotina mais tranquila e previsível tende a me fazer bem no dia a dia." },
  { "id": 10, "mode": "I", "text": "Uma rotina mais dinâmica, com bastante interação, tende a me fazer bem no dia a dia." },

  { "id": 11, "mode": "I", "text": "Quando preciso decidir algo importante, ter mais informações antes de agir me deixa mais confortável." },
  { "id": 12, "mode": "I", "text": "Eu me sinto confortável tomando decisões mesmo sem ter certeza total do resultado." },
  { "id": 13, "mode": "I", "text": "Pensar bastante antes de agir me deixa mais seguro." },
  { "id": 14, "mode": "I", "text": "Agir rápido e ajustar depois costuma funcionar bem para mim." },
  { "id": 15, "mode": "I", "text": "Ao decidir algo, eu costumo confiar mais na lógica do que no sentimento." },
  { "id": 16, "mode": "I", "text": "Ao decidir algo, eu costumo levar bastante em conta como as pessoas vão se sentir." },
  { "id": 17, "mode": "I", "text": "Ter regras e critérios claros facilita minhas decisões." },
  { "id": 18, "mode": "I", "text": "Ter liberdade para decidir do meu próprio jeito facilita minhas decisões." },
  { "id": 19, "mode": "I", "text": "Quando preciso decidir sob pressão, eu tendo a travar ou a ficar mais focado." },
  { "id": 20, "mode": "F", "text": "Eu me arrependo mais de não ter tentado do que de ter tentado e errado." },

  { "id": 21, "mode": "I", "text": "Trabalhar com prazos curtos costuma me motivar." },
  { "id": 22, "mode": "I", "text": "Trabalhar sob muita cobrança tende a me estressar." },
  { "id": 23, "mode": "I", "text": "Para mim, errar faz parte do processo de aprendizado." },
  { "id": 24, "mode": "I", "text": "Quando algo dá errado, isso costuma me desanimar mais do que deveria." },
  { "id": 25, "mode": "I", "text": "Eu consigo manter a calma quando algo sai diferente do planejado." },
  { "id": 26, "mode": "I", "text": "Ter alguém acompanhando e cobrando de perto me ajuda a render melhor." },
  { "id": 27, "mode": "I", "text": "Ter autonomia, mesmo com risco de errar, me faz render melhor." },
  { "id": 28, "mode": "I", "text": "Situações competitivas tendem a me estimular." },
  { "id": 29, "mode": "I", "text": "Ambientes muito competitivos tendem a me desgastar." },
  { "id": 30, "mode": "I", "text": "Eu sinto que aprendo mais com os erros do que apenas com os acertos." },

  { "id": 31, "mode": "I", "text": "Trabalhar diretamente com pessoas me traz satisfação." },
  { "id": 32, "mode": "I", "text": "Ajudar alguém a aprender ou evoluir me faz me sentir bem." },
  { "id": 33, "mode": "F", "text": "Eu evito resolver conflitos entre pessoas." },
  { "id": 34, "mode": "I", "text": "Eu me sinto confortável orientando ou dando feedback para outras pessoas." },
  { "id": 35, "mode": "I", "text": "Trabalhar com números, dados ou sistemas me parece mais interessante do que trabalhar diretamente com pessoas." },
  { "id": 36, "mode": "I", "text": "Ver impacto direto na vida de alguém me motiva mais do que ver um impacto mais abstrato." },
  { "id": 37, "mode": "F", "text": "Eu percebo com facilidade como as pessoas ao meu redor estão se sentindo." },
  { "id": 38, "mode": "I", "text": "Ambientes muito frios, técnicos ou distantes tendem a me desmotivar." },
  { "id": 39, "mode": "I", "text": "Eu me sinto mais útil quando estou ajudando alguém do que quando estou resolvendo algo sozinho." },
  { "id": 40, "mode": "F", "text": "Trabalhar em equipe costuma ser melhor para mim do que trabalhar sozinho." },

  { "id": 41, "mode": "I", "text": "Eu aprendo melhor quando posso colocar a mão na massa, em vez de só ouvir explicações." },
  { "id": 42, "mode": "I", "text": "Entender como as coisas funcionam por trás me dá satisfação." },
  { "id": 43, "mode": "I", "text": "Eu me envolvo mais quando um assunto desperta curiosidade real, mesmo sendo difícil." },
  { "id": 44, "mode": "I", "text": "Assuntos muito teóricos tendem a me desanimar." },
  { "id": 45, "mode": "I", "text": "Eu gosto de aprender coisas novas mesmo sem saber exatamente para que vou usar depois." },
  { "id": 46, "mode": "I", "text": "Ter uma aplicação prática clara me ajuda a me interessar mais por um conteúdo." },
  { "id": 47, "mode": "F", "text": "Quando algo me interessa, eu me aprofundo bastante." },
  { "id": 48, "mode": "F", "text": "Eu perco o interesse quando algo demora muito para mostrar resultado." },
  { "id": 49, "mode": "I", "text": "Eu prefiro aprender aos poucos, com constância, do que tudo de uma vez." },
  { "id": 50, "mode": "I", "text": "Aprender algo difícil e finalmente entender me traz satisfação." },

  { "id": 51, "mode": "I", "text": "Quando ninguém está me avaliando, eu ainda me esforço para fazer as coisas bem feitas." },
  { "id": 52, "mode": "F", "text": "Eu termino o que começo." },
  { "id": 53, "mode": "I", "text": "Ter reconhecimento das pessoas é algo importante para mim." },
  { "id": 54, "mode": "I", "text": "Fazer algo que tenha significado pessoal é mais importante para mim do que agradar os outros." },
  { "id": 55, "mode": "I", "text": "Eu me sinto mal quando percebo que estou fazendo algo apenas por obrigação." },
  { "id": 56, "mode": "I", "text": "Eu costumo seguir meus próprios valores mesmo quando isso não é o caminho mais fácil." },
  { "id": 57, "mode": "I", "text": "Eu consigo me imaginar feliz, no futuro, fazendo algo parecido com o que gosto hoje." },
  { "id": 58, "mode": "I", "text": "Pensar no futuro me anima mais do que me assusta." },
  { "id": 59, "mode": "I", "text": "Eu sinto que ainda estou me descobrindo — e eu fico confortável com isso." },
  { "id": 60, "mode": "I", "text": "Ter liberdade para mudar de ideia ao longo do caminho é importante para mim." }
]
